# DataFrame 구조

In [4]:
import numpy as np
import pandas as pd

a=pd.DataFrame([[10,20,30],[40,50,60],[70,80,90]])
print(a)
type(a)
len(a)
a

    0   1   2
0  10  20  30
1  40  50  60
2  70  80  90

    0   1   2
0  10  20  30
1  40  50  60
2  70  80  90

In [5]:
data=[[10,20,30],[40,50,60],[70,80,90]]
a=pd.DataFrame(data,columns=['1차','2차','3차'],index=['One','Two','Three'])
a

       1차  2차  3차
One    10  20  30
Two    40  50  60
Three  70  80  90

In [9]:
mdf

   weight  height gender
0    80.0     170      m
1    70.4     167      f
2    56.9     162      f
3    66.8     164      m
4    51.2     159      f

In [8]:
mdf=pd.DataFrame({'weight':[80.0,70.4,56.9,66.8,51.2],'height':[170,167,162,164,159],'gender':['m','f','f','m','f']})
print("몸무게 목록")
print(mdf["weight"])
print("\n몸무게와 키 목록")
print(mdf[['weight','height']])
print("\n---키가 165이상")
print(mdf[mdf.height>=165])
print("\n---남자들만...")
print(mdf[mdf.gender=='m'])
print("\n---키로 정렬하면...")
print(mdf.sort_values(by="height"))
print("\n---몸무게로 정렬하면...")
print(mdf.sort_values(by='weight',ascending=False))

몸무게 목록
0    80.0
1    70.4
2    56.9
3    66.8
4    51.2
Name: weight, dtype: float64

몸무게와 키 목록
   weight  height
0    80.0     170
1    70.4     167
2    56.9     162
3    66.8     164
4    51.2     159

---키가 165이상
   weight  height gender
0    80.0     170      m
1    70.4     167      f

---남자들만...
   weight  height gender
0    80.0     170      m
3    66.8     164      m

---키로 정렬하면...
   weight  height gender
4    51.2     159      f
2    56.9     162      f
3    66.8     164      m
1    70.4     167      f
0    80.0     170      m

---몸무게로 정렬하면...
   weight  height gender
0    80.0     170      m
1    70.4     167      f
3    66.8     164      m
2    56.9     162      f
4    51.2     159      f

# DataFrame 생성: 1 column

In [11]:
d=[0,1,2,3,4,5,6,7,8,9]
df=pd.DataFrame(d)
print(df)

   0
0  0
1  1
2  2
3  3
4  4
5  5
6  6
7  7
8  8
9  9

In [14]:
names=['Bob','Jessica','Mary','John','Kate']
births=[988,155,77,578,973]
BabySet=list(zip(names,births))
df=pd.DataFrame(data=BabySet,columns=['Names','Births'])
print(df)

     Names  Births
0      Bob     988
1  Jessica     155
2     Mary      77
3     John     578
4     Kate     973

# DataFrame 생성: dict

In [17]:
DicBabySet={"Names":names,"Births":births}
df=pd.DataFrame(DicBabySet)
print(df)

     Names  Births
0      Bob     988
1  Jessica     155
2     Mary      77
3     John     578
4     Kate     973

# DataFrame 생성: Series

In [19]:
area_dic={'california':423967,'Texas':695662,'New York':141297,'Florida':170312,"Illinois":149995}
pop_dic={'california':1423967,'Texas':1695662,'New York':1141297,'Florida':1170312,"Illinois":1149995}
area=pd.Series(area_dic)
pop=pd.Series(pop_dic)
states=pd.DataFrame({'population':pop,"area":area})
print(states)

            population    area
california     1423967  423967
Texas          1695662  695662
New York       1141297  141297
Florida        1170312  170312
Illinois       1149995  149995

In [21]:
states.index

Index(['california', 'Texas', 'New York', 'Florida', 'Illinois'], dtype='object')

In [22]:
states.values

array([[1423967,  423967],
       [1695662,  695662],
       [1141297,  141297],
       [1170312,  170312],
       [1149995,  149995]], dtype=int64)

# DataFrame 생성

In [26]:
raw_data={'col0':[1,2,3,4],'col1':[10,20,30,40],'col2':[100,200,300,400]}
data=pd.DataFrame(raw_data)
print(data)

   col0  col1  col2
0     1    10   100
1     2    20   200
2     3    30   300
3     4    40   400

In [27]:
data['col1']

0    10
1    20
2    30
3    40
Name: col1, dtype: int64

In [28]:
type(data['col1'])

pandas.core.series.Series

In [29]:
data=pd.DataFrame(raw_data,index=['r0','r1','r2','r3'])
data

    col0  col1  col2
r0     1    10   100
r1     2    20   200
r2     3    30   300
r3     4    40   400

In [31]:
data['col2']

r0    100
r1    200
r2    300
r3    400
Name: col2, dtype: int64

In [32]:
data=pd.DataFrame(raw_data, columns=['col1','col2','col0'])
print(data)

   col1  col2  col0
0    10   100     1
1    20   200     2
2    30   300     3
3    40   400     4

In [33]:
import numpy as np
data['col3']=np.nan
data

   col1  col2  col0  col3
0    10   100     1   NaN
1    20   200     2   NaN
2    30   300     3   NaN
3    40   400     4   NaN

In [35]:
data.loc[1,['col3']]=2000
data

   col1  col2  col0    col3
0    10   100     1     NaN
1    20   200     2  2000.0
2    30   300     3     NaN
3    40   400     4     NaN

In [37]:
data['NewCol']=data['col1']+data['col2']
data

   col1  col2  col0    col3  NewCol
0    10   100     1     NaN     110
1    20   200     2  2000.0     220
2    30   300     3     NaN     330
3    40   400     4     NaN     440

In [38]:
data.loc[4]=np.nan
data

   col1   col2  col0    col3  NewCol
0  10.0  100.0   1.0     NaN   110.0
1  20.0  200.0   2.0  2000.0   220.0
2  30.0  300.0   3.0     NaN   330.0
3  40.0  400.0   4.0     NaN   440.0
4   NaN    NaN   NaN     NaN     NaN